package B_Operation;

public class Operation_01 {
	public static void main(String[] args){
		/*
		 
		 1. 연산자 기본
		   - 단항연산자(x) : ++(내 타입에 맞춰 하나씩 증가), --, +(양수), -, ~, !(not), (타입)캐스트연산자
		   - 이항연산자(x+y)
		     : 산술연산자 => +, -, *, /, %(나머지 연산자), <<(왼쪽으로 두번), >>(오른쪽으로 두번), >>>(오른쪽으로 세번)
		     : 비교연산자 => <, >, <=, >=, ==, !=(같지않냐)
		     : 논리연산자 => &, |(shift 원표시), ^(위와 아래가 다를때), &&, ||
		   - 삼항연산자 : 논리 결과 ? true 일때 실행 : false일때 실행
		   - 대입연산자 : =, op=
		   
		   * instanceof
		   
		  2. 연산우선순위
		   - 산술 > 비교 > 논리 > 대입 
		    ex) int a = 1 +2 +3;
		   - 단항 > 이항 > 삼항
		    int b = 10;
		    int a = b>0 ? 3+4 : 5+7;
		                   7     12
		                   
		                   
		 
		 
		 
		 
		 */
		
		
		
		
		
		
	}
}
